[
  {
    "Q": "Material error occurs",
    "A": "Please ensure you are using lilToon v2.0 or later, or Poiyomi v9.0.54 or later. Reimporting materials or clearing the shader cache may also resolve the issue. Please also verify that the material name does not contain any special characters such as symbols."
  },
  {
    "Q": "Expression Menu is not working",
    "A": "The animations might be corrupted. Try deleting the \"Assets/nHaruka/PCSS4VRC\" folder and then re-importing the package."
  },
  {
    "Q": "The screen goes pitch black in Play Mode",
    "A": "In the Unity Editor's Play Mode, the screen will appear black unless you use AV3Emulator (available via VCC); Gesture Manager alone is not sufficient. This happens because EditorOnly lights used for previewing are removed, and the avatar will not be illuminated unless its layers are configured identically to VRChat."
  },
  {
    "Q": "Shadows appear jagged or pixelated",
    "A": "If this occurs in VRChat, please check and adjust your Shadow Quality settings in the graphics menu."
  },
  {
    "Q": "Noise appears in the shadows",
    "A": "This is partially by design. Increasing the sampling count in the material properties can mitigate it, but be aware that this will increase the performance load."
  },
  {
    "Q": "Shadows don't appear / Material turns pitch black",
    "A": "This occurs with materials that have a Render Queue of 2500 or higher. Please adjust the Render Queue."
  },
  {
    "Q": "Transparent materials look unnatural",
    "A": "Due to Unity's specifications, transparent materials normally do not receive or cast shadows. We have implemented a workaround for this, so please understand it may not be perfect. Some trial and error may be required in certain cases."
  },
  {
    "Q": "Blush or facial expressions appear darkened",
    "A": "This can often be improved by assigning a solid black texture to the CastMask. If that is too much trouble, the quickest fix is to revert only that specific material to a non-PCSS (original) material."
  },
  {
    "Q": "Sampler-related compilation error in Poiyomi",
    "A": "This is caused by exceeding the maximum number of texture samplers. Please turn off unnecessary modules to save texture slots."
  },
  {
    "Q": "Shadows appear thin or 'shrunk' (especially on fingers)",
    "A": "This occurs when the ShadowNormalBias value is too high. Please lower the ShadowNormalBias value or create a BiasMask."
  }
]
